cf/DocumentJournals/ЖурналЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DocumentJournal>
		<Properties>
			<Name>ЖурналЗаказов</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ВнутреннийЗаказ</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
			</RegisteredDocuments>
		</Properties>
	</DocumentJournal>
</MetaDataObject>

cf/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<BasedOn>
				<xr:Item>BusinessProcess.ЗаявкаПокупателя</xr:Item>
				<xr:Item>Document.ЧекККМ</xr:Item>
				<xr:Item>Document.РеализацияТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>BusinessProcess.ИнтернетЗаявка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ОборотыДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процесс</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.ПродажаВРозницу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятоОт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВТомЧислеНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаНеучтенныйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПКО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроведеноПоККТ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
								<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОтгрузки</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияПереданныхТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/DocumentJournals/ЖурналЗаказов/Forms/ФормаШустрого/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьПараметрыВремени()
	
	ТекДата = ТекущаяДата();
	
	//Список.Параметры.УстановитьЗначениеПараметра("ЗаЧас", 			ТекДата - 3600);
	//Список.Параметры.УстановитьЗначениеПараметра("За3Часа", 		ТекДата - 3600 * 3);
	//Список.Параметры.УстановитьЗначениеПараметра("Сегодня", 		НачалоДня(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("Вчера", 			НачалоДня(НачалоДня(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("Неделя", 			НачалоНедели(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ПрошлаяНеделя", 	НачалоНедели(НачалоНедели(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ЭтотМесяц", 		НачалоМесяца(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ВПрошломМесяце", 	НачалоМесяца(НачалоМесяца(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ВЭтотГод", 		НачалоГода(ТекДата));
	
	//Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", 	'00010101');
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекДата);
	//Список.Параметры.УстановитьЗначениеПараметра("НачалоИсчесления", '20120401');

	ТекстИнфо = "Сформировано в " + Формат(ТекДата,"ДЛФ=T");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.РежимВыбора Тогда
		Элементы.Список.РежимВыбора = Истина;
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", '00010101');
	
	ОбновитьПараметрыВремени();
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Слежение.Записать("Открытие. Рабочие заказы", "ЖурналыДокументов.ЖурналЗаказов");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцесс(ЗаказСсылка)
	
	Возврат Заказы.ПолучитьПроцесс(ЗаказСсылка);
	
КонецФункции
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	текДанные = Элементы.Список.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
	
		Процесс = ПолучитьПроцесс(текДанные.Ссылка);
		Если Процесс <> Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("БизнесПроцесс." + текДанные.ИмяПроцесса + ".ФормаОбъекта", Новый Структура("Ключ", Процесс), ВладелецФормы);КонецЕсли; КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПараметрыВремени();
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиПлатежноеПоручениеВходящее(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПлатежноеПоручениеВходящее.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриходныйКассовыйОрдер(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() ИЛИ
			ИмяСобытия = СобытияСистемы.Событие_ИзмениласьЗагрузкаАвтомобиля() Тогда
			
		//ОбновитьОтображениеДанных();  КонецЕсли;
		Элементы.Список.Обновить(); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМедленнуюФорму(Команда)
	
	ОткрытьФорму("ЖурналДокументов.ЖурналЗаказов.Форма.ФормаСписка");
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьСтатусыЗаказов(Команда)
	
	ОткрытьФорму("РегистрСведений.ЗаказыЖурнал.Форма.ФормаОбновленияСтатусов");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтруктураПодчиненности(Команда)
	
	ОткрытьФорму("ОбщаяФорма.СвязанныеДокументыПроцессы", Новый Структура("Документ", Элементы.Список.ТекущиеДанные.Ссылка));
	
КонецПроцедуры

#Область Автотранспорт

//&НаКлиенте
//Процедура КомандаДобавитьЗаказ(Команда)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Куда загружать?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.ДобавитьЗаказы(ВыбрЭлемент.Значение, Элементы.Список.ВыделенныеСтроки, ДокСсылка, стрСообщения) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Добавление заказов на погрузку", ПолучитьНавигационнуюСсылку(ДокСсылка), стрСообщения, БиблиотекаКартинок.ЗагрузкаЗаказа_Добавление) КонецЕсли;КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомандаУдалитьЗаказ(Команда)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Откуда убирать?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.УдалитьЗаказы(ВыбрЭлемент.Значение, Элементы.Список.ВыделенныеСтроки, ДокСсылка, стрСообщения) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Удаление заказов с погрузки", ПолучитьНавигационнуюСсылку(ДокСсылка), стрСообщения, БиблиотекаКартинок.ЗагрузкаЗаказа_Удаление) КонецЕсли;КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомандаОчиститьМашину(Команда)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Откуда убирать?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.ОчиститьМашину(ВыбрЭлемент.Значение, Ложь, ДокСсылка) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Очищены все заказы с машины", ПолучитьНавигационнуюСсылку(ДокСсылка), ВыбрЭлемент.Значение, БиблиотекаКартинок.ЗагрузкаЗаказа_Предупреждение) КонецЕсли;КонецЕсли;

//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомандаОтгрузитьМашину(Команда)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Кого отправляем?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.ОчиститьМашину(ВыбрЭлемент.Значение, Истина, ДокСсылка) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Заказы отправлены", ПолучитьНавигационнуюСсылку(ДокСсылка), ВыбрЭлемент.Значение, БиблиотекаКартинок.ЗагрузкаЗаказа_Отправка) КонецЕсли;КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура КомандаПоказатьМашину(Команда)
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("В какой кузов заглянуть?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда
//		
//		ДокСсылка = ЗагрузкаВАвтомобильЗаказов.ПолучитьТекНарядНаЗагрузку(ВыбрЭлемент.Значение);
//		Если ДокСсылка = Неопределено Тогда
//			ПоказатьПредупреждение(,"Кузов пустой, внути нет заказ нарядов",,"Предупреждение");
//		Иначе
//			ОткрытьФорму("Документ.НарядНаЗагрузку.ФормаОбъекта", Новый Структура("Ключ", ДокСсылка));КонецЕсли;КонецЕсли;

//	
//КонецПроцедуры


#КонецОбласти
